In [2]:
import pandas as pd
import numpy as np

In [16]:
data = {
    'id' : [1,2,3],
    'name' : ['Hassan','Jawad','Ali'],
    'age' : [23,24,25]
}
df=pd.DataFrame(data)
df.head()

   id    name  age
0   1  Hassan   23
1   2   Jawad   24
2   3     Ali   25

In [17]:
data2 = {
    'id' : [1,2,3],
    'city': ['hyderabad','missusaga','Baghdad'],
    'occupation': ['DataAnalyst','DBMS','student']
}
df2=pd.DataFrame(data2)
df2.head()

   id       city   occupation
0   1  hyderabad  DataAnalyst
1   2  missusaga         DBMS
2   3    Baghdad      student

#### Merging data

In [19]:
merg1 = pd.merge(df,df2,on='id', how='inner')
merg1

   id    name  age       city   occupation
0   1  Hassan   23  hyderabad  DataAnalyst
1   2   Jawad   24  missusaga         DBMS
2   3     Ali   25    Baghdad      student